# [Словарь синонимов](https://coderun.yandex.ru/selections/hr-tech-interview/problems/dictionary-synonyms)

> Вам дан словарь, состоящий из пар слов. Каждое слово является синонимом к парному ему слову. Все слова в словаре различны. Для одного данного слова определите его синоним.

## Формат ввода
Программа получает на вход количество пар синонимов N. Далее следует N строк, каждая строка содержит ровно два слова-синонима. После этого следует одно слово.

## Формат вывода
Программа должна вывести синоним к данному слову.

## Примечание
Эту задачу можно решить и без словарей (сохранив все входные данные в списке), но решение со словарем будет более простым.

## Ограничения
Ограничение времени - 1 с
Ограничение памяти - 256 МБ

## Примеры
### Пример 1
> **Ввод**
> 3
> Hello Hi
> Bye Goodbye
> List Array
> Goodbye
> **Вывод**
> Bye

> Пример 2
> **Ввод**
> 1
> beep Car
> Car
> **Вывод**
> beep

> Пример 3
> **Ввод**
> 2
> Ololo Ololo
> Numbers 1234567890
> Numbers
> **Вывод**
> 1234567890



## Решение на Python
```python
def main():
    """
    Пример ввода и вывода числа n, где -10^9 < n < 10^9:
    n = int(input())
    print(n)
    """
    n = int(input())
    df = {}
    for _ in range(n):
        a,b = input().split()
        df[a] = b
    goal = input()
    for key,value in df.items():
        if key == goal:
            print(value)
            return
        if value == goal:
            print(key)
            return
    print(-1)


if __name__ == '__main__':
    main()
```